src/main/java/META-INF/RCService.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://tempuri.org/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" name="RCService" targetNamespace="http://tempuri.org/">
<wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://tempuri.org/">
<xs:import namespace="http://schemas.datacontract.org/2004/07/IronTracking"/>
<xs:element name="GetUserToken">
<xs:complexType>
<xs:sequence>
<xs:element minOccurs="0" name="userId" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="password" nillable="true" type="xs:string"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="GetUserTokenResponse">
<xs:complexType>
<xs:sequence>
<xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/IronTracking" minOccurs="0" name="GetUserTokenResult" nillable="true" type="q1:UserTokenResult"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="GPSAssetTracking">
<xs:complexType>
<xs:sequence>
<xs:element minOccurs="0" name="token" nillable="true" type="xs:string"/>
<xs:element xmlns:q2="http://schemas.datacontract.org/2004/07/IronTracking" minOccurs="0" name="events" nillable="true" type="q2:ArrayOfEvent"/>
</xs:sequence>
</xs:complexType>
</xs:element>
<xs:element name="GPSAssetTrackingResponse">
<xs:complexType>
<xs:sequence>
<xs:element xmlns:q3="http://schemas.datacontract.org/2004/07/IronTracking" minOccurs="0" name="GPSAssetTrackingResult" nillable="true" type="q3:ArrayOfAppointResult"/>
</xs:sequence>
</xs:complexType>
</xs:element>
</xs:schema>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/">
<xs:element name="anyType" nillable="true" type="xs:anyType"/>
<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
<xs:element name="boolean" nillable="true" type="xs:boolean"/>
<xs:element name="byte" nillable="true" type="xs:byte"/>
<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
<xs:element name="decimal" nillable="true" type="xs:decimal"/>
<xs:element name="double" nillable="true" type="xs:double"/>
<xs:element name="float" nillable="true" type="xs:float"/>
<xs:element name="int" nillable="true" type="xs:int"/>
<xs:element name="long" nillable="true" type="xs:long"/>
<xs:element name="QName" nillable="true" type="xs:QName"/>
<xs:element name="short" nillable="true" type="xs:short"/>
<xs:element name="string" nillable="true" type="xs:string"/>
<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
<xs:element name="char" nillable="true" type="tns:char"/>
<xs:simpleType name="char">
<xs:restriction base="xs:int"/>
</xs:simpleType>
<xs:element name="duration" nillable="true" type="tns:duration"/>
<xs:simpleType name="duration">
<xs:restriction base="xs:duration">
<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
</xs:restriction>
</xs:simpleType>
<xs:element name="guid" nillable="true" type="tns:guid"/>
<xs:simpleType name="guid">
<xs:restriction base="xs:string">
<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
</xs:restriction>
</xs:simpleType>
<xs:attribute name="FactoryType" type="xs:QName"/>
<xs:attribute name="Id" type="xs:ID"/>
<xs:attribute name="Ref" type="xs:IDREF"/>
</xs:schema>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/IronTracking" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/IronTracking">
<xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/>
<xs:complexType name="UserTokenResult">
<xs:sequence>
<xs:element xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays" minOccurs="0" name="exception" nillable="true" type="q1:ArrayOfKeyValueOfstringstring"/>
<xs:element minOccurs="0" name="token" nillable="true" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:element name="UserTokenResult" nillable="true" type="tns:UserTokenResult"/>
<xs:complexType name="ArrayOfEvent">
<xs:sequence>
<xs:element minOccurs="0" maxOccurs="unbounded" name="Event" nillable="true" type="tns:Event"/>
</xs:sequence>
</xs:complexType>
<xs:element name="ArrayOfEvent" nillable="true" type="tns:ArrayOfEvent"/>
<xs:complexType name="Event">
<xs:sequence>
<xs:element minOccurs="0" name="altitude" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="asset" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="battery" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="code" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="course" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="customer" nillable="true" type="tns:Customer"/>
<xs:element minOccurs="0" name="date" nillable="true" type="xs:dateTime"/>
<xs:element minOccurs="0" name="direction" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="humidity" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="ignition" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="latitude" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="longitude" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="odometer" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="serialNumber" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="shipment" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="speed" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="temperature" nillable="true" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:element name="Event" nillable="true" type="tns:Event"/>
<xs:complexType name="Customer">
<xs:sequence>
<xs:element minOccurs="0" name="id" nillable="true" type="xs:string"/>
<xs:element minOccurs="0" name="name" nillable="true" type="xs:string"/>
</xs:sequence>
</xs:complexType>
<xs:element name="Customer" nillable="true" type="tns:Customer"/>
<xs:complexType name="ArrayOfAppointResult">
<xs:sequence>
<xs:element minOccurs="0" maxOccurs="unbounded" name="AppointResult" nillable="true" type="tns:AppointResult"/>
</xs:sequence>
</xs:complexType>
<xs:element name="ArrayOfAppointResult" nillable="true" type="tns:ArrayOfAppointResult"/>
<xs:complexType name="AppointResult">
<xs:sequence>
<xs:element xmlns:q2="http://schemas.microsoft.com/2003/10/Serialization/Arrays" minOccurs="0" name="exception" nillable="true" type="q2:ArrayOfKeyValueOfstringstring"/>
<xs:element minOccurs="0" name="idJob" type="xs:long"/>
</xs:sequence>
</xs:complexType>
<xs:element name="AppointResult" nillable="true" type="tns:AppointResult"/>
</xs:schema>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
<xs:complexType name="ArrayOfKeyValueOfstringstring">
<xs:annotation>
<xs:appinfo>
<IsDictionary xmlns="http://schemas.microsoft.com/2003/10/Serialization/">true</IsDictionary>
</xs:appinfo>
</xs:annotation>
<xs:sequence>
<xs:element minOccurs="0" maxOccurs="unbounded" name="KeyValueOfstringstring">
<xs:complexType>
<xs:sequence>
<xs:element name="Key" nillable="true" type="xs:string"/>
<xs:element name="Value" nillable="true" type="xs:string"/>
</xs:sequence>
</xs:complexType>
</xs:element>
</xs:sequence>
</xs:complexType>
<xs:element name="ArrayOfKeyValueOfstringstring" nillable="true" type="tns:ArrayOfKeyValueOfstringstring"/>
</xs:schema>
</wsdl:types>
<wsdl:message name="IRCService_GetUserToken_InputMessage">
<wsdl:part name="parameters" element="tns:GetUserToken"/>
</wsdl:message>
<wsdl:message name="IRCService_GetUserToken_OutputMessage">
<wsdl:part name="parameters" element="tns:GetUserTokenResponse"/>
</wsdl:message>
<wsdl:message name="IRCService_GPSAssetTracking_InputMessage">
<wsdl:part name="parameters" element="tns:GPSAssetTracking"/>
</wsdl:message>
<wsdl:message name="IRCService_GPSAssetTracking_OutputMessage">
<wsdl:part name="parameters" element="tns:GPSAssetTrackingResponse"/>
</wsdl:message>
<wsdl:portType name="IRCService">
<wsdl:operation name="GetUserToken">
<wsdl:input wsaw:Action="http://tempuri.org/IRCService/GetUserToken" message="tns:IRCService_GetUserToken_InputMessage"/>
<wsdl:output wsaw:Action="http://tempuri.org/IRCService/GetUserTokenResponse" message="tns:IRCService_GetUserToken_OutputMessage"/>
</wsdl:operation>
<wsdl:operation name="GPSAssetTracking">
<wsdl:input wsaw:Action="http://tempuri.org/IRCService/GPSAssetTracking" message="tns:IRCService_GPSAssetTracking_InputMessage"/>
<wsdl:output wsaw:Action="http://tempuri.org/IRCService/GPSAssetTrackingResponse" message="tns:IRCService_GPSAssetTracking_OutputMessage"/>
</wsdl:operation>
</wsdl:portType>
<wsdl:binding name="BasicHttpBinding_IRCService" type="tns:IRCService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="GetUserToken">
<soap:operation soapAction="http://tempuri.org/IRCService/GetUserToken" style="document"/>
<wsdl:input>
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="GPSAssetTracking">
<soap:operation soapAction="http://tempuri.org/IRCService/GPSAssetTracking" style="document"/>
<wsdl:input>
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="RCService">
<wsdl:port name="BasicHttpBinding_IRCService" binding="tns:BasicHttpBinding_IRCService">
<soap:address location="http://gps.rcontrol.com.mx/Tracking/wcf/RCService.svc"/>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>