pkg/integrators/recursoconfiable/features/recursoconfiable_integrator/data/send_datasource copy2.txt

package data

import (
	"bytes"
	"encoding/json"
	"fmt"
	"net/http"
	"os"

	"github.com/MaddSystems/jonobridge/common/models"
	"github.com/MaddSystems/jonobridge/common/utils"

	"regexp"
	"strings"
	"time"
)

type ElasticLogData struct {
	Client       string `json:"client"`
	IMEI         string `json:"imei"`
	SoapEnvelope string `json:"soap-envelope"`
	Time         string `json:"time"`
	StatusCode   int    `json:"status-code"`
	StatusText   string `json:"status-text"`
}

func sendToElastic(logData ElasticLogData, customerName string) error {
	// Obtener la URL base de Elasticsearch
	elasticBaseURL := os.Getenv("ELASTIC_URL")
	if elasticBaseURL == "" {
		elasticBaseURL = "http://elasticserver.dwim.mx:9200"
	}

	// Convertir customerName a snake_case en minúsculas
	customerName = toSnakeCase(customerName)

	elasticURL := fmt.Sprintf("%s/%s/_doc", elasticBaseURL, customerName)

	// Debug: Verificar datos antes de enviar
	utils.VPrint("Elastic URL: %s\n", elasticURL)
	//utils.VPrint("Log Data: %+v\n", logData)

	// Convertir los datos a JSON
	jsonData, err := json.Marshal(logData)
	if err != nil {
		utils.VPrint("Error marshaling log data: %v\n", err)
		return fmt.Errorf("error marshaling log data: %v", err)
	}

	// Debug: Ver JSON generado
	//utils.VPrint("JSON Data to send: %s\n", string(jsonData))

	// Crear la solicitud HTTP
	req, err := http.NewRequest("POST", elasticURL, bytes.NewBuffer(jsonData))
	if err != nil {
		utils.VPrint("Error creating elastic request: %v\n", err)
		return fmt.Errorf("error creating elastic request: %v", err)
	}

	req.Header.Set("Content-Type", "application/json")

	// Enviar la solicitud a Elasticsearch
	client := &http.Client{}
	resp, err := client.Do(req)
	if err != nil {
		utils.VPrint("Error sending to Elasticsearch: %v\n", err)
		return fmt.Errorf("error sending to elastic: %v", err)
	}
	defer resp.Body.Close()

	// Verificar el código de respuesta
	if resp.StatusCode >= 400 {
		utils.VPrint("Elastic error: status code %d\n", resp.StatusCode)
		return fmt.Errorf("elastic error: status code %d", resp.StatusCode)
	}

	utils.VPrint("Data successfully sent to Elasticsearch with status code %d\n", resp.StatusCode)
	return nil
}

func toSnakeCase(input string) string {
	// Reemplazar espacios por guiones bajos
	re := regexp.MustCompile(`\s+`)
	snake := re.ReplaceAllString(strings.TrimSpace(input), "_")

	// Convertir a minúsculas
	return strings.ToLower(snake)
}

func SendSOAPRequest(url, plates, token, dataStr string) error {
	var data models.JonoModel
	// Deserializar el JSON en la estructura ComplementData
	err := json.Unmarshal([]byte(dataStr), &data)
	if err != nil {
		return fmt.Errorf("error deserializing JSON: %v", err)
	}

	imei := data.IMEI

	var packet models.DataPacket
	for _, p := range data.ListPackets {
		packet = p
		break // Tomar solo el primer paquete
	}

	eventCode := fmt.Sprintf("%d", packet.EventCode.Code)
	latitude := fmt.Sprintf("%f", packet.Latitude)
	longitude := fmt.Sprintf("%f", packet.Longitude)
	altitude := fmt.Sprintf("%d", packet.Altitude)
	speed := fmt.Sprintf("%d", packet.Speed)
	direction := fmt.Sprintf("%d", packet.Direction)
	date := packet.Datetime.Format(time.RFC3339)
	battery := fmt.Sprintf("%d", 100)
	humidity := fmt.Sprintf("%d", 0)
	ignition := "True"
	odometer := fmt.Sprintf("%d", packet.Mileage)
	serial_number := fmt.Sprintf("%d", 0)
	shipment := fmt.Sprintf("%d", 0)
	temperature := fmt.Sprintf("%d", 0)
	vehicle_type := ""
	vehicle_brand := ""
	vehicle_model := ""

	CUSTOMER_ID := os.Getenv("CUSTOMER_ID")
	CUSTOMER_NAME := os.Getenv("CUSTOMER_NAME")

	body := fmt.Sprintf(`<?xml version="1.0" encoding="UTF-8"?>
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:iron="http://schemas.datacontract.org/2004/07/IronTracking">
       <soapenv:Header/>
       <soapenv:Body>
          <tem:GPSAssetTracking>
             <tem:token>%s</tem:token>
             <tem:events>
                <iron:Event>
                   <iron:altitude>%s</iron:altitude>
                   <iron:asset>%s</iron:asset>
                   <iron:battery>%s</iron:battery>
                   <iron:code>%s</iron:code>
                   <iron:course>%s</iron:course>
                   <iron:customer>
                      <iron:id>%s</iron:id>
                      <iron:name>%s</iron:name>
                   </iron:customer>
                   <iron:date>%s</iron:date>
                   <iron:direction>%s</iron:direction>
                   <iron:humidity>%s</iron:humidity>
                   <iron:ignition>%s</iron:ignition>
                   <iron:latitude>%s</iron:latitude>
                   <iron:longitude>%s</iron:longitude>
                   <iron:odometer>%s</iron:odometer>
                   <iron:serialNumber>%s</iron:serialNumber>
                   <iron:shipment>%s</iron:shipment>
                   <iron:speed>%s</iron:speed>
                   <iron:temperature>%s</iron:temperature>
                   <iron:vehicleType>%s</iron:vehicleType>
                   <iron:vehicleBrand>%s</iron:vehicleBrand>
                   <iron:vehicleModel>%s</iron:vehicleModel>
                </iron:Event>
             </tem:events>
          </tem:GPSAssetTracking>
       </soapenv:Body>
    </soapenv:Envelope>`, token, altitude, plates, battery, eventCode, direction,
		CUSTOMER_ID, CUSTOMER_NAME, date, direction, humidity, ignition, latitude, longitude,
		odometer, serial_number, shipment, speed, temperature, vehicle_type, vehicle_brand, vehicle_model)

	req, err := http.NewRequest("POST", url, bytes.NewBuffer([]byte(body)))
	if err != nil {
		utils.VPrint("Error creating SOAP request: %v\n", err)
		return fmt.Errorf("error creating SOAP request: %v", err)
	}

	req.Header.Add("Content-Type", "text/xml")
	req.Header.Add("SOAPAction", "http://tempuri.org/IRCService/GPSAssetTracking")

	client := &http.Client{}
	resp, err := client.Do(req)
	if err != nil {
		utils.VPrint("Error sending SOAP request: %v\n", err)
		return fmt.Errorf("error sending SOAP request: %v", err)
	}
	utils.VPrint("SOAP Response Status: %s\n", resp.Status) // Added log for response status
	defer resp.Body.Close()

	elastic_doc_name := os.Getenv("ELASTIC_DOC_NAME")
	// Send log to Elasticsearch
	logData := ElasticLogData{
		Client:       elastic_doc_name,
		IMEI:         imei,
		SoapEnvelope: body,
		Time:         time.Now().Format(time.RFC3339),
		StatusCode:   resp.StatusCode,
		StatusText:   resp.Status,
	}

	utils.VPrint("Sending logs to Elasticsearch for customer: %s\n", CUSTOMER_NAME) // Added log for customer name
	if err := sendToElastic(logData, elastic_doc_name); err != nil {
		utils.VPrint("Error sending to Elasticsearch: %v", err)
	}

	return nil
}
